---
type: StructuralSectionSigmaProfileWithFold
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 6
tags: [revit-api, class]
---

# StructuralSectionSigmaProfileWithFold

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithFold` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionSigmaProfileWithFold | 2016 | `public StructuralSectionSigmaProfileWithFold ( double width , double height , double wallNominalThickness , double wallDesignThickness , double innerFillet , double centroidHorizontal , double centroidVertical , double p` |
| Property | BendWidth | 2016 | `public double BendWidth { get ; set ; }` |
| Property | FoldWidth | 2016 | `public double FoldWidth { get ; set ; }` |
| Property | LipLength | 2016 | `public double LipLength { get ; set ; }` |
| Property | MiddleBendLength | 2016 | `public double MiddleBendLength { get ; set ; }` |
| Property | TopBendLength | 2016 | `public double TopBendLength { get ; set ; }` |